{"offset":0,"results":[{"title_link/_text":"Lessons Learned The Hard Way","textholder_description":"Karen Cohen is the SDK Product Manager at Wix. She designs APIs, libraries, tools, and integration solutions for developers looking to market apps on the Wix platform. Cohen comes from a diverse technical background, having worked in multiple startups and army intelligence. She is an avid traveler and foodie.","post_image":"http://endpointcon.com/wp-content/uploads/2015/07/karencohen.jpeg","posthead_value":"Karen Cohen","title_value":"Keynote:","post_image/_alt":"Karen Cohen","title_link":"http://endpointcon.com/posts/2015/07/01/karen-cohen/","appointment_value":"(Wix)"},{"title_link/_text":"Having a Pulse on Your Platform: Know When Your API is Down Before Your Developers Do","textholder_description":"Kamyar currently serves as Staff Engineer and Partner Engineering team lead at LinkedIn. Over the past three years, he's helped shape LinkedIn's developer platform offering as well as lead some of LinkedIn's most strategic partnerships, including Apple and Samsung. Previous to LinkedIn, he built the first external APIs at MySpace and worked to get early native mobile applications on iOS, Android, and BB to integrate on the platform.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/kamyar1.jpg","posthead_value":"Kamyar Mohager","title_value":"Keynote:","post_image/_alt":"kamyar","title_link":"http://endpointcon.com/posts/2015/07/01/kamyar-mohager/","appointment_value":"(LinkedIn)"},{"title_link/_text":"Integrating, exposing and managing distributed data via RESTful APIs and open source","textholder_description":"Rob Allen is a software developer and consultant with many years of web development experience using PHP and related technologies. He contributes to Zend Framework and other open source projects. A Zend Framework specialist, Rob is a member of the ZF Community team and also wrote Zend Framework in Action. He is UK-based and runs Nineteen Feet Limited, focussing on web development, training and consultancy.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/Manfred-Bortenschlager-WIPJam-128x128.jpg","posthead_value":"Manfred Bortenschlager & Cojan van Ballegooijen","title_value":"Session:","post_image/_alt":"Manfred Bortenschlager","title_link":"http://endpointcon.com/posts/2015/07/01/manfred-bortenschlager-cojan-van-ballegooijen/","appointment_value":"(3scale / RedHat)"},{"title_link/_text":"The Fortune Teller API","textholder_description":"Bas is a programmer, scientist, and IT manager. At ING, he is responsible for setting up a data lake where data from all core systems of the bank is gathered and distributed. His academic background is in Artificial Intelligence and Informatics. Bas has a background in software development, design and architecture with a broad technical view from C++ to Prolog to Scala. He occasionally teaches programming courses and is a regular speaker on conferences and informal meetings.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/basgeerdink-128x128.png","posthead_value":"Bas Geerdink","title_value":"Session:","post_image/_alt":"Bas Geerdink","title_link":"http://endpointcon.com/posts/2015/07/01/bas-geerdink/","appointment_value":"(ING)"},{"title_link/_text":"APIs and the Semantic Web: publishing information instead of data","textholder_description":"Data Specialist and Co-Founder of Apiwise. Used crawlers to fetch data from social networks in 2005. Evangelizing APIs since then, got triggered by the Open Data movement and led the case \"Linked Data for developers\" for the Dutch Linked Data Programme resulting in a sixth star on top of Tim Berners-Lee's \"Five stars of data\". Brewmaster at MQTT API driven brewery De Brouwtoren as well.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/dimitrivanhees-128x128.jpg","posthead_value":"Dimitri van Hees","title_value":"Session:","post_image/_alt":"Dimitri van Hees","title_link":"http://endpointcon.com/posts/2015/07/01/dimitri-van-hees/","appointment_value":"(Apiwise)"},{"title_link/_text":"Angular.js and Google Cloud Endpoints","textholder_description":"Stefan Hogendoorn is driven by technique and has a passion for Cloud Computing. At Qlouder he is responsible for all technical aspects during projects as Chief Geek of the company. He also coaches new developers and is the lead innovative architect. Stefan has a background in ICT for over 20 years. He has worked (amongst others) on the integration of Google Apps and the Google Cloud Platform, and developed many small and large business apps. Furthermore, he has a lot of experience with cross-disciplinary projects, both national and international.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/unnamed-2-128x128.jpg","posthead_value":"Stefan Hogendoorn","title_value":"Session:","post_image/_alt":"Stefan Hogendoorn","title_link":"http://endpointcon.com/posts/2015/07/01/stefan-hogendoorn/","appointment_value":"(Qlouder)"},{"title_link/_text":"Your API is a UI","textholder_description":"A 23-year American transplant to the UK, Christopher is an Engineering Team Lead at DataSift, overseeing the web application, public API and a number of internal services at the world's leading processor of human data. Prior to this, he was a Senior Engineer at Time Out Digital, helping to design and deliver their global platform as well as the day to day running of the Time Out London and Paris websites.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/christopher-128x128.jpg","posthead_value":"Christopher Hoult","title_value":"Session:","post_image/_alt":"Christopher Hoult","title_link":"http://endpointcon.com/posts/2015/07/01/christopher-hoult/","appointment_value":"(DataSift)"},{"title_link/_text":"7 Modern Tools for API Testing and Monitoring","textholder_description":"Neil heads up developer relations at Runscope, an API monitoring, testing and debugging company. Formerly, Neil was with Mashery, an API management company, where he focused on developers tools and experience. He is the co-creator of I/O Docs, an open-source interactive API documentation engine.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/neil_twitter_001-1-128x128.png","posthead_value":"Neil Mansilla","title_value":"Session:","post_image/_alt":"Neil Mansilla","title_link":"http://endpointcon.com/posts/2015/07/01/neil-mansilla/","appointment_value":"(Runscope)"},{"title_link/_text":"DDP - the real-time API for web applications","textholder_description":"Peter is a creativist. He's passionate about cutting edge technology, channeling his creativity through full-stack development, high-five team synergy, music and photography. He loves to excite and assist the world with beautiful applications and scalable solutions.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/peerdeman-128x128.jpg","posthead_value":"Peter Peerdeman","title_value":"Session:","post_image/_alt":"Peter Peerdeman","title_link":"http://endpointcon.com/posts/2015/07/01/peter-peerdeman/","appointment_value":"(Lifely)"},{"title_link/_text":"Docker and the rest of the containers eco-system","textholder_description":"Pini has 15+ years of experience in delivering software in Israel and Netherlands. Starting as a developer and moving through technical, managerial and consulting positions in Configuration Management and Operations areas, Pini acquired deep understanding of the software delivery processes and currently helping organisations around Europe with improving software delivery pipeline by introducing Docker and other cutting edge technologies.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/Container-Solutions-portrait02-128x128.jpg","posthead_value":"Pini Reznik","title_value":"Session:","post_image/_alt":"Pini Reznik","title_link":"http://endpointcon.com/posts/2015/07/01/pini-reznik/","appointment_value":"(Container Solutions)"},{"title_link/_text":"The turbulent life of an API and how you can help it survive","textholder_description":"Steve is a prolific open source contributor, hypermedia enthusiast, author, and contracts with Mozilla to work on Rust. He's written the books \"Designing Hypermedia APIs\", \"Rails 4 in Action\" and \"Rust for Rubyists\".","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/ClemensSchotte-128x128.jpg","posthead_value":"Clemens Schotte & Valery Jacobs","title_value":"Session:","post_image/_alt":"ClemensSchotte","title_link":"http://endpointcon.com/posts/2015/07/01/clemens-schotte/","appointment_value":"(Microsoft)"},{"title_link/_text":"Choosing the Right Database","textholder_description":"David is a technical lead for Softwire, working with teams to deliver the needs of a range of clients (including the BBC and Microsoft) by choosing and developing with the right tools for the job. Since he started coding professionally, he has worked extensively on full-stack systems, thinking deeply about everything from how to store data, to robust APIs, to the pixel-perfect placement of images. When not writing code, David has experience in statistics and simulation; training the software devs of tomorrow; and finding good pubs.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/davidsimons-128x128.jpg","posthead_value":"David Simons","title_value":"Session:","post_image/_alt":"David Simons","title_link":"http://endpointcon.com/posts/2015/07/01/david-simons/","appointment_value":"(Softwire)"},{"title_link/_text":"The first few milliseconds of https","textholder_description":"Joshua Thijssen is a freelance consultant and trainer. His daily work consists of maintaining code bases, working on different projects and helping other to achieve higher standards in both coding and thinking. He is author of the PHP|Architect book \"Mastering the SPL library\" and the Symfony Rainbow Series, founder of the Dutch Web Alliance and regular speaker at national and international conferences.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/6274257396_cb57cecb0e_o-128x128.jpg","posthead_value":"Joshua Thijssen","title_value":"Session:","post_image/_alt":"Joshua Thijssen","title_link":"http://endpointcon.com/posts/2015/07/01/joshua-thijssen/","appointment_value":"(NoxLogic)"},{"title_link/_text":"Hooked on HTTP/2: Microservices development with gRPC","textholder_description":"Based in London, UK, Mandy is a Developer Relations Engineer at Google specializing in Container and Cloud technologies and working to make the world a better place for developers building applications for the Cloud.","post_image":"http://endpointcon.com/wp-content/uploads/2014/07/mandywaite-128x128.jpg","posthead_value":"Mandy Waite","title_value":"Session:","post_image/_alt":"Mandy Waite","title_link":"http://endpointcon.com/posts/2015/07/01/mandy-waite/","appointment_value":"(Google)"}],"cookies":[],"connectorVersionGuid":"0384df1d-9ca5-bdf9-fe7d-7968074485a7","connectorGuid":"5afd8c3c-7bbe-491f-ae5f-a1b012325d42","pageUrl":"http://endpointcon.com/posts/category/speakers/","outputProperties":[{"name":"post_image","type":"IMAGE"},{"name":"posthead_value","type":"STRING"},{"name":"appointment_value","type":"STRING"},{"name":"title_value","type":"STRING"},{"name":"title_link","type":"URL"},{"name":"textholder_description","type":"STRING"}]}